const sidebar = {
    '/1/':[{
        title:"语法基础",
        collapsable: false,
        children:[
            '基本介绍',
            '数据类型'
        ]
    }],
    // '/入门基础-面向对象/': [
    //     ''
    // ],
    // '/入门基础-文件操作/':[
    //     ''
    // ],
    // '/入门基础-网络与多线程/':[
    //     ''
    // ],
    // '/入门基础-数据操作/':[
    //     ''
    // ],
    // '/入门基础-常用工具类/':[
    //     ''
    // ],
    // '/web基础-JSP/':[
    //     ''
    // ],
    // '/web基础-Servlet/':[
    //     ''
    // ],
    // '/web基础-Tomcat/':[
    //     ''
    // ],
    // '/框架-基础/':[
    //     ''
    // ],
    // '/框架-Hibernate/':[
    //     ''
    // ],
    // '/框架-Mybatis/':[
    //     ''
    // ],
    // '/框架-Spring/':[
    //     ''
    // ],
    // '/框架-SpringMVC/':[
    //     ''
    // ],
    // '/框架-Struts2/':[
    //     ''
    // ],
    // '/项目实战/':[
    //     ''
    // ],
    // '/实用工具/':[
    //     ''
    // ]
}
module.exports = {
    sidebar
}